import telebot
from time import sleep
import random

bot = telebot.TeleBot("6576389933:AAGMQQlH5XYTaA0xv4kMDzvLqr4rGTGsARM")

adhkar = [
    "سبحان الله",
    "الحمد لله",
    "لا إله إلا الله",
    "الله أكبر",
    "استغفر الله العظيم",
    "لا حول ولا قوة إلا بالله",
    "اللهم صل على محمد وعلى آل محمد",
    "اللهم اغفر لي ولوالدي وللمسلمين والمسلمات الأحياء منهم والأموات",
    "اللهم ارزقني الجنة ونعيمها",
    "اللهم أعوذ بك من عذاب النار",
    "اللهم اهدني فيمن هديت، وعافني فيمن عافيت، وتولني فيمن توليت.",
    "رضيت بالله رباً، وبالإسلام ديناً، وبمحمد صلى الله عليه وسلم نبياً ورسولاً.",
    "حسبي الله لا إله إلا هو، عليه توكلت وهو رب العرش العظيم.",
    "أعوذ بكلمات الله التامات من شر ما خلق.",
    "سبحان الله وبحمده، سبحان الله العظيم.",
    "البخاري ومسلم - عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: 'من قال حين يسمع النداء: اللهم رب هذه الدعوة التامة والصلاة القائمة آت محمدًا الوسيلة والفضيلة وابعثه مقامًا محمودًا الذي وعدته' حلت له شفاعتي يوم القيامة.",
    "البخاري ومسلم - عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: 'من قال حين يسمع النداء: اللهم رب هذه الدعوة التامة والصلاة القائمة آت محمدًا الوسيلة والفضيلة وابعثه مقامًا محمودًا الذي وعدته' حلت له شفاعتي يوم القيامة.",
    # يمكنك إضافة المزيد من الأحاديث هنا
]


def main():
    while True:
        updates = bot.get_updates()
        for update in updates:
            if update.message and update.message.chat:
                chat_id = update.message.chat.id
                dhikr = random.choice(adhkar)
                bot.send_message(chat_id, dhikr)
        sleep(50)

if __name__ == "__main__":
    try:
        main()
    except Exception as e:
        print(f"An error occurred: {e}")
